Revit 2027 API
WireConduitTypeSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual WireConduitTypeSetIterator ForwardIterator()
Public Overridable Function ForwardIterator As WireConduitTypeSetIterator
public:
virtual WireConduitTypeSetIterator^ ForwardIterator()
abstract ForwardIterator : unit -> WireConduitTypeSetIterator
override ForwardIterator : unit -> WireConduitTypeSetIterator
Return Value
WireConduitTypeSetIterator
Returns a forward moving iterator to the set.
See Also
Reference
WireConduitTypeSet Class
Autodesk.Revit.DB.Electrical Namespace